{
  "_meta": {
    "maxChars": {
      "newGame": 20,
      "continue": 20,
      "inventoryTitle": 20,
      "inventoryKeycard": 20,
      "inventoryKeyboard": 20,
      "inventoryDoorKey": 20,
      "digitalLabel": 20,
      "analogLabel": 20,
      "responsesText": 20,
      "stage1Task1": 100,
      "stage1Task2": 100,
      "stage1Task3": 100,
      "stage1Task4": 100,
      "stage2Task1": 100,
      "stage2Task2": 100,
      "stage2Task3": 100,
      "stage2Task4": 100,
      "stage2Task5": 100,
      "stage2Task6": 100,
      "stage3Task1": 100,
      "stage3Task2": 100,
      "stage3Task3": 100,
      "stage3Task4": 100,
      "stage3Task5": 100,
      "stage4Task1": 100,
      "stage4Task2": 100,
      "stage4Task3": 100,
      "stage4Task4": 100,
      "stage4Task5": 100,
      "stage1Reminder1": 100,
      "stage1Reminder2": 100,   
      "stage1Reminder3": 100,
      "stage1IntroText1": 80,
      "stage1IntroText2": 120,
      "stage1IntroText3": 70,
      "stage1IntroText4": 100,
      "stage1IntroText5": 160,
      "stage1IntroText6": 110,
      "stage1IntroText7": 90,
      "stage1IntroText8": 160,
      "stage1IntroText9": 180,
      "stage1IntroText10": 70,
      "stage1IntroText10a": 130,
      "stage1IntroText11": 130,
      "stage1IntroText12": 110,
      "stage1IntroText13": 140,
      "stage1IntroText14": 90,
      "stage1IntroText15": 140,
      "stage1IntroText16": 70,
      "stage1IntroText17": 120,
      "stage1IntroText18": 60,
      "stage1IntroText19": 60,
      "stage1IntroText20": 60,
      "stage1IntroText21": 160,
      "stage1IntroText22": 160,
      "stage1IntroText23": 140,
      "stage1IntroText23a": 140,
      "stage1IntroText24": 160,
      "stage1IntroText25": 120,
      "stage1IntroText25a": 130,
      "stage1IntroText25b": 80,
      "stage1IntroText26": 60,
      "stage1IntroText27": 70,
      "stage1IntroText28": 65,
      "stage1IntroText29": 90,
      "stage1IntroText30": 100,
      "stage1IntroText31": 60,
      "stage1IntroText32": 50,
      "stage1IncorrectSpeakerItem": 90,
      "stage1IncorrectClockItem": 100,
      "stage2IntroText1": 90,
      "stage2IntroText2": 100,
      "stage2IntroText3": 110,
      "stage2IntroText4": 135,
      "stage2IntroText5": 80,
      "stage2IntroText6": 140,
      "stage2IntroText7": 70,
      "stage2IntroText8": 50,
      "stage2IntroText9": 40,
      "stage2IntroText10": 40,
      "stage2IntroText11": 90,
      "stage2IntroText12": 100,
      "stage2IntroText13": 110,
      "stage2IntroText14": 110,
      "stage2IntroText15": 50,
      "stage2IntroText16": 60,
      "stage2IntroText17": 80,
      "stage2IntroText18": 100,
      "stage2IntroText19": 100,
      "stage2IntroText20": 110,
      "stage3IntroText1": 120,
      "stage3IntroText2": 110,
      "stage3IntroText3": 90,
      "stage3IntroText4": 80,
      "stage3IntroText5": 70,
      "stage3IntroText6": 60,
      "stage3IntroText7": 65,
      "stage3IntroText8": 100,
      "stage3IntroText9": 90,
      "stage3IntroText9a": 90,
      "stage3IntroText10": 80,
      "stage3IntroText11": 140,
      "stage3IntroText12R1": 70,
      "stage3IntroText13R2": 70,
      "stage3IntroText14R3": 70,
      "stage3IntroText15": 130,
      "stage3IntroText16": 130,
      "stage3IntroText17": 50,
      "stage3IntroText18": 70,
      "stage3IntroText19": 50,
      "stage3IntroText20": 90,
      "stage3IntroText21": 40,
      "stage3IntroText22": 90,
      "stage3IntroText23": 70,
      "stage3IntroText24": 60,
      "stage3IntroTextMorseCodeDoc1": 70,
      "stage3IntroTextMorseCodeDoc2": 70,
      "stage3IntroTextMorseCodeDoc2": 70,
      "stage3IntroTextMorseCodeComplete": 110,
      "stage4IntroText1": 90,
      "stage4IntroText2": 110,
      "stage4IntroText3": 130,
      "stage4IntroText4": 160,
      "stage4IntroText5": 50,
      "stage4IntroText6": 80,
      "stage4IntroText7": 70,
      "stage4IntroText8": 60,
      "stage4IntroText9": 110,
      "stage4IntroText10": 80,
      "stage4IntroText11": 110,
      "stage4IntroText12": 80,
      "stage4IntroText13": 50,
      "stage4IntroText14": 40,
      "stage4IntroText15": 90,
      "stage4IntroText16": 75,
      "stage4IntroText17": 85,
      "stage4IntroText18": 90,
      "stage4IntroText19": 50,
      "stage4IntroText20": 60,
      "stage5IntroText1": 40,
      "stage5IntroText2": 90,
      "stage5IntroText3": 50,
      "stage5IntroText4": 160,
      "stage5IntroText5": 60,
      "stage5IntroText6": 30,
      "stage5IntroText7": 80,
      "stage5IntroText8": 80,
      "stage5IntroText9": 20,
      "stage5IntroText10": 70,
      "stage5IntroText11": 30,
      "stage5IntroText12": 100,
      "stage5IntroText13": 90,
      "stage5IntroText14": 50,
      "stage5IntroText15": 40,
      "stage5IntroText16": 60,
      "stage5IntroText17": 100,
      "stage5IntroText18": 120,
      "stage5IntroText19": 30,
      "stage5IntroText20": 60,
      "stage5IntroText21": 90,

      "autoSave": 40
    }
  },
  "en": {
    "newGame": "New Game",
    "continue": "Continue",
    "inventoryTitle": "Inventory",
    "inventoryKeycard": "Employee Badge",
    "inventoryKeyboard": "PC Keyboard",
    "inventoryDoorKey": "Door Key",
    "digitalLabel": "Digital Signal",
    "analogLabel": "Analog Signal",
    "responsesText": "Possible responses", 
    "stage1Task1": "Examine the bridge computer console.",
    "stage1Task2": "Find the employee badge and a digital device to reply with.",
    "stage1Task3": "Use both collected items on the bridge console.",
    "stage1Task4": "Locate an analog clock somewhere around the bridge.",
    "stage2Task1": "Turn on lights using the digital light switch.",
    "stage2Task2": "Find an analog light switch.",
    "stage2Task3": "Find 3 devices that can receive and transmit digital signals.",
    "stage2Task4": "Read and reply to the message on the smartwatch.",
    "stage2Task5": "Locate the door code information on the smartwatch.",
    "stage2Task6": "Use the found door code on the keypad of the door.",
    "stage3Task1": "Access the center console.",
    "stage3Task2": "Find the 3 Morse code folders.",
    "stage3Task3": "Decypher the Morse code.",
    "stage3Task4": "Open the safe.",
    "stage3Task5": "Use the door key on the door.",
    "stage4Task1": "Check the smart tablet for an incoming message.",
    "stage4Task2": "Search for 3 data disks with the binary decoder on them.",
    "stage4Task3": "Decode binary to find landing coordinates for ship.",
    "stage4Task4": "Enter the translated coordinates into the landing console.",
    "stage4Task5": "Enter the ship.",
    "stage1Reminder1": "Technologies make it possible to receive and decode digitized information.",
    "stage1Reminder2": "Digital signals are either on or off.",   
    "stage1Reminder3": "Digital information can maintain quality over a long-distance transmission, as opposed to analog signals.",     
    "stage1IntroText1": "Greetings robot 486. Welcome to Communication Space Station 80.",
    "stage1IntroText2": "Here we analyze, decrypt, and respond to digital and analog signals, received from throughout the galaxy.",
    "stage1IntroText3": "Your job is to decode the signals and reply where you can.",
    "stage1IntroText4": "Looks like work has already started. There is a message waiting on the ship's console.",
    "stage1IntroText5": "You can walk over there with WASD or the arrow keys. If you want to interact with the world, you can use the left mouse button on the touchpad or mouse.",
    "stage1IntroText6": "Excellent work! Before we check out the incoming message. Let's talk about digital and analog signals.",
    "stage1IntroText7": "A digital signal is a signal that represents data as a sequence of discrete values.",
    "stage1IntroText8": "An analog signal is a voltage, current, or physical quantity that continuously and infinitely varies in accordance with a time-varying parameter.",
    "stage1IntroText9": "The major difference between both signals is that analog signals have continuous electrical signals, while digital signals have non-continuous electrical signals.",
    "stage1IntroText10": "2 important things to know about digital signals.",
    "stage1IntroText10a": "1: Technologies make it possible to receive and decode digitized information. 2: Digital signals are either on or off.",
    "stage1IntroText11": "Some examples of technologies that use digital signals are cell phones, smartwatches, and even the average PC keyboard.",
    "stage1IntroText12": "Some examples of analog signals are radio waves, television waves, sound waves and the average wall clock.",
    "stage1IntroText13": "Looks like the message we received is encrypted and needs an employee badge to decode. We need to find one somewhere in this room.",
    "stage1IntroText14": "Also, can you find a piece of digital technology that will allow us to type a reply?",
    "stage1IntroText15": "Can you find both of these items now? To pick up an item, simply click it with the left mouse button on the touchpad or mouse.",
    "stage1IntroText16": "Excellent this keyboard is digital and just what we need.",
    "stage1IntroText17": "No, this old TV is an analog device, we need a digital device that will allow to type a reply. Try again.",
    "stage1IntroText18": "There is nothing in this locker. Try another!",
    "stage1IntroText19": "Excellent you have found an employee badge.",
    "stage1IntroText20": "Now we have both items, let's use them on the console.",
    "stage1IntroText21": "You can open your inventory with the button on the screen and you can take an item out of the inventory by clicking it with the left mouse button.",
    "stage1IntroText22": "To use a held object, simply move the mouse over the thing you want to use it on and click the left mouse button, on the mouse or touchpad.",
    "stage1IntroText23": "Did you know that digital information can maintain quality over a long-distance transmission, as opposed to analog signals.",
    "stage1IntroText23a": "Excellent work! A long range, digital message is coming through on the screen. Can you find the message on screen?",
    "stage1IntroText24": "Hello Space Station 80. I have messaged to inform you that I left you some digital devices in the crews quarters, just in the next room. Have a look.",
    "stage1IntroText25": "This message has come from 200 light years away. We can respond with a digital signal or an analog signal.",
    "stage1IntroText25a": "Remember that we need to transmit this message over a long distance, so we need to send the correct type of signal.",
    "stage1IntroText25b": "Can you search the console and look for the correct method of response?",
    "stage1IntroText26": "Thank you. I’ll check them out when I next get a break.",
    "stage1IntroText27": "Devices? Awesome! I hope one of them is the R-Pad 9000!",
    "stage1IntroText28": "I'll have a look soon. I'm really busy. Thanks though!",
    "stage1IntroText29": "Before we go check out the new devices. We need to find out if it’s break time.",
    "stage1IntroText30": "Somewhere around the bridge is an analog clock. Can you find it please and get the time?",
    "stage1IntroText31": "This is a clock but it's digital. Try again!",
    "stage1IntroText32": "Excellent this wall mounted clock is an analog device. And it’s time for our break! Let's head to the door and explore the crew quarters.",
    "stage1IncorrectSpeakerItem": "This clock is digital but it won’t help us reply to the message on the console. Try again!",
    "stage1IncorrectClockItem": "These are analog speakers and won’t help us reply to the message. Try again!",    
    "stage2IntroText1": "It's so dark in here, how will we find the devices that Robot 80 left us?",
    "stage2IntroText2": "We need to turn on the light. Light switches also come in digital and analog forms.",
    "stage2IntroText3": "Can you search the room for a digital light switch? We can use the torch in your inventory.",
    "stage2IntroText4": "Excellent. This light switch is digital. How strange, the light didn't turn on. Can you find an analog light switch, please?",
    "stage2IntroText5": "Oh, fantastic. The lights are on. Let's search for those devices.",
    "stage2IntroText6": "It is important to know, that modern technologies use digitized signals as a reliable way to encode and transmit information.",
    "stage2IntroText7": "Can you find 3 modern digital devices around the crew quarters?",
    "stage2IntroText8": "Excellent a digital smartphone.",
    "stage2IntroText9": "Fantastic. A digital tablet.",
    "stage2IntroText10": "Oh wonderful, a smartwatch.",
    "stage2IntroText11": "Did you know that Information can be stored on various types of devices? ",
    "stage2IntroText12": "That's all 3 devices. Oh, there is a message on the smartwatch. Let’s take a closer look!",
    "stage2IntroText13WatchMessage1": "Hey dude. There is a new security system stopping you from getting into the communication deck.",
    "stage2IntroText14WatchMessage2": "I left the code somewhere on this device. You will need to have a look through its files and find it.",
    "stage2IntroText15": "Thanks dude  I'll have a look now!",
    "stage2IntroText16": "Oh great, more security! Thanks for the code.",
    "stage2IntroText17": "Thank you. I hope it's easier to remember than the last one.",
    "stage2IntroText18": "Excellent. Let's enter the code by the exit door and check out the communication deck.",
    "stage2IntroText19DoorCorrect": "That’s the correct code, the door is unlocked. Lets head to the communications room.",
    "stage2IntroText20": "Oh, that code didn’t work. Let’s check out the smartwatch again!",
    "stage3IntroText1": "Welcome to the communication room. Here we will take a closer look at digital communications in greater detail.",
    "stage3IntroText2": "Before we progress you should know that some communication involves the use of digital signals.",
    "stage3IntroText3": "There is an incoming digital message on the center console. Let's check it out.",
    "stage3IntroText4": "Hey boss. I'm on my way to take over your shift. I'll be docking shortly.",
    "stage3IntroText5": "Can you please get to the cargo bay and open the hanger doors?",
    "stage3IntroText6": "I’ve sent over the security codes for the safe.",
    "stage3IntroText7": "Inside you should find the keycard to the hanger bay.",
    "stage3IntroText8": "I’ve encrypted the safe combination in Morse code. You’ll need to find a way to decrypt it.",
    "stage3IntroText9": "There should be some folders around the communications deck to help you out.",
    "stage3IntroText9a": "Each folder should have part of the decoding document. Try and collect them all!",
    "stage3IntroText10": "I’ll leave the code on your communications console, for when you're ready.",
    "stage3IntroText11": "We should reply but need to use a long-distance reply. Can you search the console and find the correct way to respond, please?",
    "stage3IntroText12R1": "I’ll get the key and head to the cargo bay now. See you soon!",
    "stage3IntroText13R2": "Thanks for letting me know, Im looking forward to a day off!",
    "stage3IntroText14R3": "I hope the cargo bay is tidy. I'll check when I get in there.",
    "stage3IntroText15": "Morse code is a great example of how digital signals can be sent as wave pulses, such as pulses of light or electricity.",
    "stage3IntroText16": "Take a look around the communication deck and see if you can find the document folders with Morse code inside.",
    "stage3IntroText17": "Yes. This sounds and looks like Morse code.",
    "stage3IntroText18": "Let’s head back to the console and decode our safe combination.",
    "stage3IntroText19": "This is not Morse code. Keep looking!",
    "stage3IntroText20": "Use the decoding document to decode the Morse code and get the safe combination.",
    "stage3IntroText21": "Enter the safe code here.",
    "stage3IntroText22": "That is not correct, head back to the console and decode the Morse code again.",
    "stage3IntroText23": "Excellent, the safe is open. Let's get to the cargo deck.",
    "stage3IntroText24": "Excellent. Let’s use this key on the door!",
    "stage3IntroTextMorseCodeDoc1": "Excellent, we found the numbers 1 to 3 in Morse code.",
    "stage3IntroTextMorseCodeDoc2": "Amazing, these are the numbers 4 to 7 in Morse code.",
    "stage3IntroTextMorseCodeDoc3": "Fantastic. These are the numbers 8 to 0 in Morse code.",
    "stage3IntroTextMorseCodeComplete": "That’s the entire document collected. Let’s decipher the safe combination on the main console.",    
    "stage4IntroText1": "Welcome to the space dock. Our task here is to help the approaching ship land.",
    "stage4IntroText2": "We have a digital message on our smart tablet. Please take a look, when you get a moment.",
    "stage4IntroText3": "Did you know that digital information can be stored without significant degradation, as opposed to analog information?",
    "stage4IntroText4": "The digital message on our tablet is safely stored inside the memory of the device and will stay there until the device falls into disrepair.",
    "stage4IntroText5": "Hey dude. I’m coming into dock my ship.",
    "stage4IntroText6": "Oh no, someone has encoded the landing coordinates into binary.",
    "stage4IntroText7": "Binary is a method of storing data as a series of 1s and 0s.",
    "stage4IntroText8": "Digital signals can be stored as binary code.",
    "stage4IntroText9": "Can you please search for the 3 digital data disks around the dock to help decode the landing coordinates?",
    "stage4IntroText10": "The data on these disks and the disks themselves are both digital.",
    "stage4IntroText11": "Excellent, the data you collected can be accessed from your smart tablet after you collect all 3.",
    "stage4IntroText12": "This is an analog item. You are looking for 3 digital items. Try again!",
    "stage4IntroText13": "Fantastic, one more disk to collect.",
    "stage4IntroText14": "That’s all the disks collected.",
    "stage4IntroText15": "Let’s head back to our smart tablet and decode the landing coordinates.",
    "stage4IntroText16": "Let’s use the data we collected to translate this binary message.",
    "stage4IntroText17": "Excellent. Let’s input the data we decoded into the docks landing console.",
    "stage4IntroText18": "That code doesn’t work. Try and decode the message again and have another go!",
    "stage4IntroText19": "Fantastic. The ship has safely docked.",
    "stage5IntroText20": "Let's go into the ship and talk to the pilot.",
    "stage5IntroText1": "Welcome aboard the USS Esses!",
    "stage5IntroText2": "We need to talk to the pilot but first, we should talk about analog signals.",
    "stage5IntroText3": "Analog signals vary continuously.",
    "stage5IntroText4": "A good example of an analog signal is the human voice. Talking use air to vibrate the vocal cords and create sounds that vary in tone and pitch.",
    "stage5IntroText5": "Let's put this to the test and talk to the pilot.",
    "stage5IntroText6": "Hi. How are you doing?",
    "stage5IntroText7": "Much better now I've safely landed. Something is wrong with the ship!",
    "stage5IntroText8": "Can you please use the main console to contact the space mechanic?",
    "stage5IntroText9": "I'll wait here.",
    "stage5IntroText10": "Did you know that some communications use analog signals?",
    "stage5IntroText11": "Let's test this now.",
    "stage5IntroText12": "Can you find the correct method of contacting the mechanic by using an analog method?",
    "stage5IntroText13": "Well done. Making a voice call would use an analog method of communication.",
    "stage5IntroText14": "Morse code is digital. Try again!",
    "stage5IntroText15": "Binary is digital. Try again!",
    "stage5IntroText16": "Hello? I'm getting strange readings from your ship.",
    "stage5IntroText17": "Could you please search the ship for an analog thermometer and get the temperature reading?",
    "stage5IntroText18": "Wow, 200 degrees! We need to purge the ship of heat. Can you hit the giant red button on the console, please?",
    "stage5IntroText19": "Thank you very much!",
    "stage5IntroText20": "Feel free to finish work for the day. I'll take over.",
    "stage5IntroText21": "Thank you for working hard to help understand digital and analog signals.",
    "autoSave": "Autosaving..."
  },
  "es": {
    "newGame": "New Game",
    "continue": "Continue",
    "inventoryTitle": "Inventory",
    "inventoryKeycard": "Employee Badge",
    "inventoryKeyboard": "PC Keyboard",
    "inventoryDoorKey": "Door Key",
    "digitalLabel": "Digital Signal",
    "analogLabel": "Analog Signal",
    "responsesText": "Possible responses",  
    "stage1Task1": "Examine the bridge computer console.",
    "stage1Task2": "Find the employee badge and a digital device to reply with.",
    "stage1Task3": "Use both collected items on the bridge console.",
    "stage1Task4": "Locate an analog clock somewhere around the bridge.",
    "stage2Task1": "Turn on lights using the digital light switch.",
    "stage2Task2": "Find an analog light switch.",
    "stage2Task3": "Find 3 devices that can receive and transmit digital signals.",
    "stage2Task4": "Read and reply to the message on the smartwatch.",
    "stage2Task5": "Locate the door code information on the smartwatch.",
    "stage2Task6": "Use the found door code on the keypad of the door.",
    "stage3Task1": "Access the center console.",
    "stage3Task2": "Find the 3 Morse code folders.",
    "stage3Task3": "Decypher the Morse code.",
    "stage3Task4": "Open the safe.",
    "stage3Task5": "Use the door key on the door.",
    "stage4Task1": "Check the smart tablet for an incoming message.",
    "stage4Task2": "Search for 3 data disks with the binary decoder on them.",
    "stage4Task3": "Decode binary to find landing coordinates for ship.",
    "stage4Task4": "Enter the translated coordinates into the landing console.",
    "stage4Task5": "Enter the ship.",
    "stage1Reminder1": "Technologies make it possible to receive and decode digitized information.",
    "stage1Reminder2": "Digital signals are either on or off.",   
    "stage1Reminder3": "Digital information can maintain quality over a long-distance transmission, as opposed to analog signals.",          
    "stage1IntroText1": "Greetings robot 486. Welcome to Communication Space Station 80.",
    "stage1IntroText2": "Here we analyze, decrypt, and respond to digital and analog signals, received from throughout the galaxy.",
    "stage1IntroText3": "Your job is to decode the signals and reply where you can.",
    "stage1IntroText4": "Looks like work has already started. There is a message waiting on the ship's console.",
    "stage1IntroText5": "You can walk over there with WASD or the arrow keys. If you want to interact with the world, you can use the left mouse button on the touchpad or mouse.",
    "stage1IntroText6": "Excellent work! Before we check out the incoming message. Let's talk about digital and analog signals.",
    "stage1IntroText7": "A digital signal is a signal that represents data as a sequence of discrete values.",
    "stage1IntroText8": "An analog signal is a voltage, current, or physical quantity that continuously and infinitely varies in accordance with a time-varying parameter.",
    "stage1IntroText9": "The major difference between both signals is that analog signals have continuous electrical signals, while digital signals have non-continuous electrical signals.",
    "stage1IntroText10": "2 important things to know about digital signals.",
    "stage1IntroText10a": "1: Technologies make it possible to receive and decode digitized information. 2: Digital signals are either on or off.",
    "stage1IntroText11": "Some examples of technologies that use digital signals are cell phones, smartwatches, and even the average PC keyboard.",
    "stage1IntroText12": "Some examples of analog signals are radio waves, television waves, sound waves and the average wall clock.",
    "stage1IntroText13": "Looks like the message we received is encrypted and needs an employee badge to decode. We need to find one somewhere in this room.",
    "stage1IntroText14": "Also, can you find a piece of digital technology that will allow us to type a reply?",
    "stage1IntroText15": "Can you find both of these items now? To pick up an item, simply click it with the left mouse button on the touchpad or mouse.",
    "stage1IntroText16": "Excellent this keyboard is digital and just what we need.",
    "stage1IntroText17": "No, this old TV is an analog device, we need a digital device that will allow to type a reply. Try again.",
    "stage1IntroText18": "There is nothing in this locker. Try another!",
    "stage1IntroText19": "Excellent you have found an employee badge.",
    "stage1IntroText20": "Now we have both items, let's use them on the console.",
    "stage1IntroText21": "You can open your inventory with the button on the screen and you can take an item out of the inventory by clicking it with the left mouse button.",
    "stage1IntroText22": "To use a held object, simply move the mouse over the thing you want to use it on and click the left mouse button, on the mouse or touchpad.",
    "stage1IntroText23": "Did you know that digital information can maintain quality over a long-distance transmission, as opposed to analog signals.",
    "stage1IntroText23a": "Excellent work! A long range, digital message is coming through on the screen. Can you find the message on screen?",
    "stage1IntroText24": "Hello Space Station 80. I have messaged to inform you that I left you some digital devices in the crews quarters, just in the next room. Have a look.",
    "stage1IntroText25": "This message has come from 200 light years away. We can respond with a digital signal or an analog signal.",
    "stage1IntroText25a": "Remember that we need to transmit this message over a long distance, so we need to send the correct type of signal.",
    "stage1IntroText25b": "Can you search the console and look for the correct method of response?",
    "stage1IntroText26": "Thank you. I’ll check them out when I next get a break.",
    "stage1IntroText27": "Devices? Awesome! I hope one of them is the R-Pad 9000!",
    "stage1IntroText28": "I'll have a look soon. I'm really busy. Thanks though!",
    "stage1IntroText29": "Before we go check out the new devices. We need to find out if it’s break time.",
    "stage1IntroText30": "Somewhere around the bridge is an analog clock. Can you find it please and get the time?",
    "stage1IntroText31": "This is a clock but it's digital. Try again!",
    "stage1IntroText32": "Excellent this wall mounted clock is an analog device. And it’s time for our break! Let's head to the door and explore the crew quarters.",
    "stage1IncorrectSpeakerItem": "This clock is digital but it won’t help us reply to the message on the console. Try again!",
    "stage1IncorrectClockItem": "These are analog speakers and won’t help us reply to the message. Try again!",
    "stage2IntroText1": "It's so dark in here, how will we find the devices that Robot 80 left us?",
    "stage2IntroText2": "We need to turn on the light. Light switches also come in digital and analog forms.",
    "stage2IntroText3": "Can you search the room for a digital light switch? We can use the torch in your inventory.",
    "stage2IntroText4": "Excellent. This light switch is digital. How strange, the light didn't turn on. Can you find an analog light switch, please?",
    "stage2IntroText5": "Oh, fantastic. The lights are on. Let's search for those devices.",
    "stage2IntroText6": "It is important to know, that modern technologies use digitized signals as a reliable way to encode and transmit information.",
    "stage2IntroText7": "Can you find 3 modern digital devices around the crew quarters?",
    "stage2IntroText8": "Excellent a digital smartphone.",
    "stage2IntroText9": "Fantastic. A digital tablet.",
    "stage2IntroText10": "Oh wonderful, a smartwatch.",
    "stage2IntroText11": "Did you know that Information can be stored on various types of devices? ",
    "stage2IntroText12": "That's all 3 devices. Oh, there is a message on the smartwatch. Let’s take a closer look!",
    "stage2IntroText13WatchMessage1": "Hey dude. There is a new security system stopping you from getting into the communication deck.",
    "stage2IntroText14WatchMessage2": "I left the code somewhere on this device. You will need to have a look through its files and find it.",
    "stage2IntroText15": "Thanks dude  I'll have a look now!",
    "stage2IntroText16": "Oh great, more security! Thanks for the code.",
    "stage2IntroText17": "Thank you. I hope it's easier to remember than the last one.",
    "stage2IntroText18": "Excellent. Let's enter the code by the exit door and check out the communication deck.",
    "stage2IntroText19DoorCorrect": "That’s the correct code, the door is unlocked. Lets head to the communications room.",
    "stage2IntroText20": "Oh, that code didn’t work. Let’s check out the smartwatch again!",
    "stage3IntroText1": "Welcome to the communication room. Here we will take a closer look at digital communications in greater detail.",
    "stage3IntroText2": "Before we progress you should know that some communication involves the use of digital signals.",
    "stage3IntroText3": "There is an incoming digital message on the center console. Let's check it out.",
    "stage3IntroText4": "Hey boss. I'm on my way to take over your shift. I'll be docking shortly.",
    "stage3IntroText5": "Can you please get to the cargo bay and open the hanger doors?",
    "stage3IntroText6": "I’ve sent over the security codes for the safe.",
    "stage3IntroText7": "Inside you should find the keycard to the hanger bay.",
    "stage3IntroText8": "I’ve encrypted the safe combination in Morse code. You’ll need to find a way to decrypt it.",
    "stage3IntroText9": "There should be some folders around the communications deck to help you out.",
    "stage3IntroText9a": "Each folder should have part of the decoding document. Try and collect them all!",
    "stage3IntroText10": "I’ll leave the code on your communications console, for when you're ready.",
    "stage3IntroText11": "We should reply but need to use a long-distance reply. Can you search the console and find the correct way to respond, please?",
    "stage3IntroText12R1": "I’ll get the key and head to the cargo bay now. See you soon!",
    "stage3IntroText13R2": "Thanks for letting me know, Im looking forward to a day off!",
    "stage3IntroText14R3": "I hope the cargo bay is tidy. I'll check when I get in there.",
    "stage3IntroText15": "Morse code is a great example of how digital signals can be sent as wave pulses, such as pulses of light or electricity.",
    "stage3IntroText16": "Take a look around the communication deck and see if you can find the document folders with Morse code inside.",
    "stage3IntroText17": "Yes. This sounds and looks like Morse code.",
    "stage3IntroText18": "Let’s head back to the console and decode our safe combination.",
    "stage3IntroText19": "This is not Morse code. Keep looking!",
    "stage3IntroText20": "Use the decoding document to decode the Morse code and get the safe combination.",
    "stage3IntroText21": "Enter the safe code here.",
    "stage3IntroText22": "That is not correct, head back to the console and decode the Morse code again.",
    "stage3IntroText23": "Excellent, the safe is open. Let's get to the cargo deck.",
    "stage3IntroText24": "Excellent. Let’s use this key on the door!",
    "stage3IntroTextMorseCodeDoc1": "Excellent, we found the numbers 1 to 3 in Morse code.",
    "stage3IntroTextMorseCodeDoc2": "Amazing, these are the numbers 4 to 7 in Morse code.",
    "stage3IntroTextMorseCodeDoc3": "Fantastic. These are the numbers 8 to 0 in Morse code.",
    "stage3IntroTextMorseCodeComplete": "That’s the entire document collected. Let’s decipher the safe combination on the main console.",     
    "stage4IntroText1": "Welcome to the space dock. Our task here is to help the approaching ship land.",
    "stage4IntroText2": "We have a digital message on our smart tablet. Please take a look, when you get a moment.",
    "stage4IntroText3": "Did you know that digital information can be stored without significant degradation, as opposed to analog information?",
    "stage4IntroText4": "The digital message on our tablet is safely stored inside the memory of the device and will stay there until the device falls into disrepair.",
    "stage4IntroText5": "Hey dude. I’m coming into dock my ship.",
    "stage4IntroText6": "Oh no, someone has encoded the landing coordinates into binary.",
    "stage4IntroText7": "Binary is a method of storing data as a series of 1s and 0s.",
    "stage4IntroText8": "Digital signals can be stored as binary code.",
    "stage4IntroText9": "Can you please search for the 3 digital data disks around the dock to help decode the landing coordinates?",
    "stage4IntroText10": "The data on these disks and the disks themselves are both digital.",
    "stage4IntroText11": "Excellent, the data you collected can be accessed from your smart tablet after you collect all 3.",
    "stage4IntroText12": "This is an analog item. You are looking for 3 digital items. Try again!",
    "stage4IntroText13": "Fantastic, one more disk to collect.",
    "stage4IntroText14": "That’s all the disks collected.",
    "stage4IntroText15": "Let’s head back to our smart tablet and decode the landing coordinates.",
    "stage4IntroText16": "Let’s use the data we collected to translate this binary message.",
    "stage4IntroText17": "Excellent. Let’s input the data we decoded into the docks landing console.",
    "stage4IntroText18": "That code doesn’t work. Try and decode the message again and have another go!",
    "stage4IntroText19": "Fantastic. The ship has safely docked.",
    "stage4IntroText20": "Let's go into the ship and talk to the pilot.",
    "stage5IntroText1": "Welcome aboard the USS Esses!",
    "stage5IntroText2": "We need to talk to the pilot but first, we should talk about analog signals.",
    "stage5IntroText3": "Analog signals vary continuously.",
    "stage5IntroText4": "A good example of an analog signal is the human voice. Talking use air to vibrate the vocal cords and create sounds that vary in tone and pitch.",
    "stage5IntroText5": "Let's put this to the test and talk to the pilot.",
    "stage5IntroText6": "Hi. How are you doing?",
    "stage5IntroText7": "Much better now I've safely landed. Something is wrong with the ship!",
    "stage5IntroText8": "Can you please use the main console to contact the space mechanic?",
    "stage5IntroText9": "I'll wait here.",
    "stage5IntroText10": "Did you know that some communications use analog signals?",
    "stage5IntroText11": "Let's test this now.",
    "stage5IntroText12": "Can you find the correct method of contacting the mechanic by using an analog method?",
    "stage5IntroText13": "Well done. Making a voice call would use an analog method of communication.",
    "stage5IntroText14": "Morse code is digital. Try again!",
    "stage5IntroText15": "Binary is digital. Try again!",
    "stage5IntroText16": "Hello? I'm getting strange readings from your ship.",
    "stage5IntroText17": "Could you please search the ship for an analog thermometer and get the temperature reading?",
    "stage5IntroText18": "Wow, 200 degrees! We need to purge the ship of heat. Can you hit the giant red button on the console, please?",
    "stage5IntroText19": "Thank you very much!",
    "stage5IntroText20": "Feel free to finish work for the day. I'll take over.",
    "stage5IntroText21": "Thank you for working hard to help understand digital and analog signals.",
    "autoSave": "Autosaving..."
  },
  "zh": {
    "newGame": "New Game",
    "continue": "Continue",
    "autoSave": "...Auto Saving Complete"
  },
  "jp": {
    "newGame": "New Game",
    "continue": "Continue",
    "autoSave": "...Auto Saving Complete"
  },
  "ru": {
    "newGame": "New Game",
    "continue": "Continue",
    "autoSave": "...Auto Saving Complete"
  }
}
